# Setup

In [1]:
%load_ext sql
%sql sqlite:///data/sfscores.sqlite

'Connected: @data/sfscores.sqlite'

# Queries

## Pt1: Essentials

**1. Write a SQL query that finds the number of business ids in the businesses table**

In [2]:
%%sql 
SELECT * FROM businesses LIMIT 5;

 * sqlite:///data/sfscores.sqlite
Done.

[(10, 'Tiramisu Kitchen', '033 Belden Pl', 'San Francisco', '94104', 37.791116, -122.403816, None, 'H24', 779059, None, 'Tiramisu LLC', '33 Belden St', 'San Francisco', 'CA', '94104'),
 (19, 'Nrgize Lifestyle Cafe', '1200 Van Ness Ave, 3rd Floor', 'San Francisco', '94109', 37.786848, -122.421547, None, 'H24', None, None, '24 Hour Fitness Inc', '1200 Van Ness Ave, 3rd Floor', 'San Francisco', 'CA', '94109'),
 (24, 'OMNI S.F. Hotel - 2nd Floor Pantry', '500 California St, 2nd  Floor', 'San Francisco', '94104', 37.792888, -122.403135, None, 'H24', 352312, None, 'OMNI San Francisco Hotel Corp', '500 California St, 2nd Floor', 'San Francisco', 'CA', '94104'),
 (31, "Norman's Ice Cream and Freezes", '2801 Leavenworth St', 'San Francisco', '94133', 37.807155, -122.419004, None, 'H24', 346882, None, 'Norman Antiforda', '2801 Leavenworth St', 'San Francisco', 'CA', '94133'),
 (45, "CHARLIE'S DELI CAFE", '3202 FOLSOM St', 'S.F.', '94110', 37.747114, -122.413641, None, 'H24', 340024, '2001-10-10', 'HARB, CHARLES AND KRISTIN', '1150 SANCHEZ', 'S.F.', 'CA', '94114')]

In [3]:
%%sql
SELECT * FROM violations LIMIT 5;

 * sqlite:///data/sfscores.sqlite
Done.

[('10', 20140729, '103129', 'Moderate Risk', 'Insufficient hot water or running water'),
 ('10', 20140729, '103144', 'Low Risk', 'Unapproved or unmaintained equipment or utensils'),
 ('10', 20140114, '103119', 'Moderate Risk', 'Inadequate and inaccessible handwashing facilities'),
 ('10', 20140114, '103145', 'Low Risk', 'Improper storage of equipment utensils or linens'),
 ('10', 20140114, '103154', 'Low Risk', 'Unclean or degraded floors walls or ceilings')]

In [4]:
%%sql
SELECT * FROM inspections LIMIT 5;

 * sqlite:///data/sfscores.sqlite
Done.

[('10', None, 20160707, 'Complaint Reinspection/Followup'),
 ('10', 82, 20160503, 'Routine - Unscheduled'),
 ('10', None, 20140807, 'Reinspection/Followup'),
 ('10', 94, 20140729, 'Routine - Unscheduled'),
 ('10', None, 20140124, 'Reinspection/Followup')]

In [5]:
%%sql 
SELECT COUNT(business_id) FROM businesses;

 * sqlite:///data/sfscores.sqlite
Done.

[(7619,)]

**2. Write a SQL query that finds out how many unique business names are registered with San Francisco Food health investigation organization and name the column as unique restaurant name count.**

In [6]:
%%sql 
SELECT COUNT(DISTINCT name) as unique_restaurant_name_count
FROM businesses;

 * sqlite:///data/sfscores.sqlite
Done.

[(7060,)]

**3. Write a SQL query that finds out what is the earliest and latest date a health investigation is recorded in this database.**

In [7]:
%%sql
SELECT MIN(date), MAX(date) FROM inspections

 * sqlite:///data/sfscores.sqlite
Done.

[(20131007, 20161215)]

**4. How many businesses are there in San Francisco where their owners live in the same area (postal code/ zip code) as the business is located?**

In [8]:
%%sql
SELECT COUNT(owner_zip)
FROM businesses
WHERE owner_zip = postal_code

 * sqlite:///data/sfscores.sqlite
Done.

[(4053,)]

**5. Out of those businesses, how many of them has a registered business certificate?**

In [9]:
%%sql
SELECT COUNT(business_certificate) 
FROM businesses
WHERE (business_certificate IS NOT NULL) AND (owner_zip = postal_code)

 * sqlite:///data/sfscores.sqlite
Done.

[(3373,)]

In [10]:
%%sql
SELECT COUNT(DISTINCT business_certificate)
FROM businesses
WHERE business_certificate IS NOT NULL

 * sqlite:///data/sfscores.sqlite
Done.

[(5215,)]

## Pt2: Groupby

**6. Find out the distribution of the risk exposure of all the violations reported in the database. The first column of the result should 'risk_category' and the second column the count.**

In [11]:
%%sql
SELECT * FROM violations LIMIT 5

 * sqlite:///data/sfscores.sqlite
Done.

[('10', 20140729, '103129', 'Moderate Risk', 'Insufficient hot water or running water'),
 ('10', 20140729, '103144', 'Low Risk', 'Unapproved or unmaintained equipment or utensils'),
 ('10', 20140114, '103119', 'Moderate Risk', 'Inadequate and inaccessible handwashing facilities'),
 ('10', 20140114, '103145', 'Low Risk', 'Improper storage of equipment utensils or linens'),
 ('10', 20140114, '103154', 'Low Risk', 'Unclean or degraded floors walls or ceilings')]

In [12]:
%%sql
SELECT risk_category, COUNT(*) as count
FROM violations
GROUP BY risk_category

 * sqlite:///data/sfscores.sqlite
Done.

[('High Risk', 5608), ('Low Risk', 20996), ('Moderate Risk', 14131)]

**7. Find out the distribution of the risk exposure of all the violations reported in the database that are *water related*. Sort them by frequency (count) from high to low.**

In [13]:
%%sql
SELECT risk_category, COUNT(*) as count
FROM violations
WHERE description LIKE '%water%'
GROUP BY risk_category
Order BY count DESC

 * sqlite:///data/sfscores.sqlite
Done.

[('Moderate Risk', 630), ('High Risk', 237)]

** 8. What types of inspections does the authorities conduct and how often do they occur in general.
    Calculate the distribution of different types of inspections with their frequency (type, frequency)
    based on inspections records. Sort them in ascending order based on frequency.**

In [14]:
%%sql
SELECT type, COUNT(*) as frequency
FROM inspections
GROUP BY type
Order BY frequency ASC

 * sqlite:///data/sfscores.sqlite
Done.

[('Multi-agency Investigation', 1),
 ('Administrative or Document Review', 3),
 ('Special Event', 7),
 ('Routine - Scheduled', 74),
 ('Foodborne Illness Investigation', 80),
 ('Complaint Reinspection/Followup', 138),
 ('Structural Inspection', 170),
 ('Non-inspection site visit', 814),
 ('Complaint', 1625),
 ('New Construction', 1737),
 ('New Ownership', 1843),
 ('Reinspection/Followup', 5283),
 ('Routine - Unscheduled', 15568)]

In [15]:
%%sql
SELECT * FROM inspections LIMIT 5;

 * sqlite:///data/sfscores.sqlite
Done.

[('10', None, 20160707, 'Complaint Reinspection/Followup'),
 ('10', 82, 20160503, 'Routine - Unscheduled'),
 ('10', None, 20140807, 'Reinspection/Followup'),
 ('10', 94, 20140729, 'Routine - Unscheduled'),
 ('10', None, 20140124, 'Reinspection/Followup')]

** 9. What is the average score given to restaurants based on the type of inspection?
    Based on the results, identify the types of inspections that are not scored (NULL)
    and remove those categories from the resultset. The 'average_score' should be rounded
    to one decimal. Sort the results in ascending order based on the average score. Hint: use the function `ROUND(score, 1)`**

In [16]:
%%sql
SELECT type, ROUND(AVG(Score),1) as AVG_score
FROM inspections
WHERE Score IS NOT NULL 
GROUP BY type
Order BY AVG_score ASC

 * sqlite:///data/sfscores.sqlite
Done.

[('Reinspection/Followup', 85.0),
 ('Routine - Unscheduled', 91.2),
 ('New Ownership', 100.0)]

In [17]:
%%sql
SELECT * FROM businesses LIMIT 5;

 * sqlite:///data/sfscores.sqlite
Done.

[(10, 'Tiramisu Kitchen', '033 Belden Pl', 'San Francisco', '94104', 37.791116, -122.403816, None, 'H24', 779059, None, 'Tiramisu LLC', '33 Belden St', 'San Francisco', 'CA', '94104'),
 (19, 'Nrgize Lifestyle Cafe', '1200 Van Ness Ave, 3rd Floor', 'San Francisco', '94109', 37.786848, -122.421547, None, 'H24', None, None, '24 Hour Fitness Inc', '1200 Van Ness Ave, 3rd Floor', 'San Francisco', 'CA', '94109'),
 (24, 'OMNI S.F. Hotel - 2nd Floor Pantry', '500 California St, 2nd  Floor', 'San Francisco', '94104', 37.792888, -122.403135, None, 'H24', 352312, None, 'OMNI San Francisco Hotel Corp', '500 California St, 2nd Floor', 'San Francisco', 'CA', '94104'),
 (31, "Norman's Ice Cream and Freezes", '2801 Leavenworth St', 'San Francisco', '94133', 37.807155, -122.419004, None, 'H24', 346882, None, 'Norman Antiforda', '2801 Leavenworth St', 'San Francisco', 'CA', '94133'),
 (45, "CHARLIE'S DELI CAFE", '3202 FOLSOM St', 'S.F.', '94110', 37.747114, -122.413641, None, 'H24', 340024, '2001-10-10', 'HARB, CHARLES AND KRISTIN', '1150 SANCHEZ', 'S.F.', 'CA', '94114')]

** 10. Find the restaurant owners (owner_name) that own one or multiple restaurants in the city
    with the number of restaurants (num_restaurants) they own.
    Find the first top 10 owners ordered by descending order using the number of restaurants.**

In [18]:
%%sql
SELECT owner_name, COUNT(*) AS num_restaurants
FROM businesses
GROUP BY owner_name
ORDER BY num_restaurants DESC
LIMIT 10

 * sqlite:///data/sfscores.sqlite
Done.

[('VOLUME SERVICES AMERICA', 94),
 ('Department of Children, Youth and their Families', 64),
 ('SFUSD', 44),
 ('Volume Services, Inc.', 41),
 ("Children's Empowerment Inc.", 37),
 ('SAN FRANCISCO UNIFIED SCHOOL', 34),
 ('WALGREEN CO.', 17),
 ('Walgreen Co', 15),
 ('SMG Food and Beverage LLC', 15),
 ('Walgreen Co.', 14)]

## Pt3: Subqueries and joins

** 11. From the businesses table, select the top 10 most popular postal_code. They should be filtered to only count the restaurants owned by people/entities that own 5 or more restaurants. The final result should return a row (postal_code, count) for each 10 selection and be sorted by descending order to get the most relevant zip codes
**

In [19]:
%%sql
SELECT postal_code, COUNT(*) AS count
FROM businesses 
WHERE owner_name in (SELECT owner_name
                        FROM businesses
                        GROUP BY owner_name
                        HAVING COUNT(*) >= 5
                        ORDER BY COUNT(*) DESC)
GROUP BY postal_code
ORDER BY count DESC
lIMIT 10

 * sqlite:///data/sfscores.sqlite
Done.

[('94107', 179),
 ('94103', 68),
 ('94102', 56),
 ('94110', 32),
 ('94112', 30),
 ('94104', 28),
 ('94124', 27),
 ('94105', 23),
 ('94133', 22),
 ('94111', 21)]

**12. First let's get an idea about the inspection score our competition has.
    Based on multiple inspections, find out the minimum Score (as "min_score"),
    average Score (as "avg_score") and maximum Score (as "max_score") for all restaurant in post code "94103".
    The average score should be rounded to one decimal.**

In [20]:
%%sql
SELECT MIN(Score) AS min_score, ROUND(AVG(SCORE),1) AS avg_score, MAX(Score) AS max_score
FROM inspections
WHERE business_id  in (SELECT business_id 
                       FROM businesses
                       WHERE postal_code = 94103)

 * sqlite:///data/sfscores.sqlite
Done.

[(54, 90.2, 100)]

In [24]:
%%sql
SELECT MIN(Score) AS min_score, ROUND(AVG(SCORE),1) AS avg_score, MAX(Score) AS max_score
FROM businesses AS b
INNER JOIN inspections AS i
ON b.business_id = i.business_id
WHERE postal_code = 94103;

 * sqlite:///data/sfscores.sqlite
Done.

[(54, 90.2, 100)]

** 13. Now lets get more serious, and look at how many times restaurants in Market street
    (postal_code: 94103) has committed health violations and group them based on their risk category.
    The output should be (risk_category, count as frequency) and sorted in descending order by frequency**

In [22]:
%%sql
SELECT risk_category, COUNT(*) AS frequency
FROM violations
WHERE business_id  in (SELECT business_id 
                       FROM businesses
                       WHERE postal_code = 94103)
GROUP BY risk_category
ORDER BY frequency DESC

 * sqlite:///data/sfscores.sqlite
Done.

[('Low Risk', 1746), ('Moderate Risk', 1229), ('High Risk', 520)]

In [31]:
%%sql
SELECT risk_category, COUNT(*) AS frequency
FROM businesses
INNER JOIN violations
ON businesses.business_id = violations.business_id
WHERE postal_code = 94103
GROUP BY risk_category
ORDER BY frequency DESC

 * sqlite:///data/sfscores.sqlite
Done.

[('Low Risk', 1746), ('Moderate Risk', 1229), ('High Risk', 520)]